iarsystems/ewarm-toshiba-example-projects/TMPM471/Libraries/system_TMPM471F10.c
/**
 *******************************************************************************
 * @file    system_TMPM471F10.c
 * @brief   CMSIS Cortex-M4 Device Peripheral Access Layer Source File for the
 *          TOSHIBA 'TMPM471' Device Series 
 * @version V1.0.0
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 * 
 * Copyright(C) Toshiba Electronic Device Solutions Corporation 2024
 *******************************************************************************
 */

#include "TMPM471F10.h"

/*-------- DEFINES -----------------------------------------------------------*/
/* Define clocks */
#define CG_GEAR_FC_1            (0x00000000UL)      /*!< CG fc register value */
#define CG_GEAR_FC_2            (0x00000001UL)      /*!< CG fc/2 register value */
#define CG_GEAR_FC_4            (0x00000002UL)      /*!< CG fc/4 register value */
#define CG_GEAR_FC_8            (0x00000003UL)      /*!< CG fc/8 register value */
#define CG_GEAR_FC_16           (0x00000004UL)      /*!< CG fc/16 register value */
#define CG_PRCK_FC_1            (0x00000000UL)      /*!< CG PhiT0 fc register value */
#define CG_PRCK_FC_2            (0x00000100UL)      /*!< CG PhiT0 fc/2 register value */
#define CG_PRCK_FC_4            (0x00000200UL)      /*!< CG PhiT0 fc/4 register value */
#define CG_PRCK_FC_8            (0x00000300UL)      /*!< CG PhiT0 fc/8 register value */
#define CG_PRCK_FC_16           (0x00000400UL)      /*!< CG PhiT0 fc/16 register value */
#define CG_PRCK_FC_32           (0x00000500UL)      /*!< CG PhiT0 fc/32 register value */
#define CG_PRCK_FC_64           (0x00000600UL)      /*!< CG PhiT0 fc/64 register value */
#define CG_PRCK_FC_128          (0x00000700UL)      /*!< CG PhiT0 fc/128 register value */
#define CG_PRCK_FC_256          (0x00000800UL)      /*!< CG PhiT0 fc/256 register value */
#define CG_PRCK_FC_512          (0x00000900UL)      /*!< CG PhiT0 fc/512 register value */

#define CG_PLL0SEL_PLL0ON_SET   ((uint32_t)0x00000001)

#define CG_MCKSEL_1             (0x00000000UL)      /*!< CG fsysm, mPhiT0 fc value */
#define CG_MCKSEL_2             (0x00000040UL)      /*!< CG fsysm, mPhiT0 fc/2 value */
#define CG_MCKSEL_4             (0x00000080UL)      /*!< CG fsysm, mPhiT0 fc/4 value */

#define CG_6M_MUL_26_656_FPLL   (0x001C1535UL<<8U)      /* fPLL = 6MHz * 26.656   */
#define CG_8M_MUL_20_FPLL       (0x00245028UL<<8U)      /* fPLL = 8MHz * 20       */
#define CG_10M_MUL_16_FPLL      (0x002E9020UL<<8U)      /* fPLL = 10MHz * 16       */
#define CG_12M_MUL_13_312_FPLL  (0x0036DA1AUL<<8U)      /* fPLL = 12MHz * 13.312   */
#define CG_24M_MUL_6_65625_FPLL (0x006D195DUL<<8U)      /* fPLL = 24MHz * 6.65625   */

#define FC_KCR_KEYCODE      (0xA74A9D23UL)              /*!< The specific code that writes the FCKCR register. */
#define FC_ACCR_FCLC_4      (0x00000003UL)              /*!< Code Flash read clock 4clock  */
#define FC_ACCR_FCLC_5      (0x00000004UL)              /*!< Code Flash read clock 5clock  */
#define FC_ACCR_FCLC_6      (0x00000005UL)              /*!< Code Flash read clock 6clock  */

/* Clock Generator (CG) Configuration */
#define CLOCK_SETUP             (1U)                      /* 1:External HOSC, 0: Internal HOSC */
#define PLL_SETUP               (1U)                      /* 1:PLL used, 0: PLL not used */
#define SYSCR_GEAR_Val          (CG_GEAR_FC_1)
#define SYSCR_PRCK_Val          (CG_PRCK_FC_1)
#define SYSCR_MCKSEL_Val        (CG_MCKSEL_2)

#define CG_GEAR_MASK            ((uint32_t)0x00000007)    /*!< CG GEAR mask */
#define CG_PRCK_MASK            ((uint32_t)0x00000F00)    /*!< CG PRCK mask */
#define CG_MCKSEL_MASK          ((uint32_t)0x000000C0)    /*!< CG MCKSEL mask */
#define CG_GEARST_MASK          ((uint32_t)0x00070000)    /*!< CG GEARST mask */
#define CG_PRCKST_MASK          ((uint32_t)0x0F000000)    /*!< CG PRCKST mask */
#define CG_MCKSELPST_MASK       ((uint32_t)0xC0000000)    /*!< CG MCKSELPST mask */
#define CG_MCKSELGST_MASK       ((uint32_t)0x00C00000)    /*!< CG MCKSELGST mask */

#define STBYCR_Val              (0x00000000UL)
/* Define clocks */
#define IOSC_10M                (10000000UL)
#define IXTALH                  IOSC_10M                    /* Internal high-speed oscillator freq */



#define CG_PLL0SEL_FPLL         ((uint32_t)0x00000002)      /*!< CG PLL0SEL fPLL */
#define CG_PLL0SEL_FOSC         ((uint32_t)0x00000000)      /*!< CG PLL0SEL fosc */

#define PLL0SEL_MASK            (0xFFFFFF00UL)              /*!< CG PLL mask */

#define CG_PLL0SEL_PLL0ON_CLEAR             ((uint32_t)0xFFFFFFFE)
#define CG_PLL0SEL_PLL0SEL_SET              ((uint32_t)0x00000002)
#define CG_PLL0SEL_PLL0SEL_CLEAR            ((uint32_t)0xFFFFFFFD)
#define CG_PLL0SEL_PLL0ST_MASK              ((uint32_t)0x00000004)

#define CG_OSCSEL_EHOSC         ((uint32_t)0x00000100)      /*!< CG OSCSEL EHOSC */

#define CG_OSCCR_IHOSC1EN_CLEAR         ((uint32_t)0xFFFFFFFE)
#define CG_OSCCR_OSCF_MASK              ((uint32_t)0x00000200)
#define CG_OSCCR_OSCSEL_SET             ((uint32_t)0x00000100)
#define CG_OSCCR_EOSCEN_SET             ((uint32_t)0x00000002)

/* Configure Warm-up time */
#define HZ_1M                   (1000000UL)
#define WU_TIME_EXT             (5000UL)                    /* warm-up time for EXT is 5ms   */
#define WU_TIME_INT             (1634UL)                    /* warm-up time for INT is 163.4us x 10 */
#define WU_TIME_INT_MIN         (0x03C << 20U)              /* minimum warm-up time for INT */
#define CGWUPHCR_WUEF_R_DONE    ((uint32_t)0x00000000)      /*!< WUEF    :[R]    :Done    */

/* Warm-up setting value */
/* EOSC OSCCR<WUPT11:0> = (warm-up time(us) * EXTALH - 16) / 16 */
#define WUPHCR_WUPT_EXT         ((uint32_t)(((((uint64_t)WU_TIME_EXT * EXTALH / HZ_1M) - 16UL) /16UL) << 20U))
/* IOSC OSCCR<WUPT11:0> = ((warm-up time(us) - 63.3us) * IXTALH - 41) / 16 */
#define WUPHCR_WUPT_INT         ((uint32_t)(((((uint64_t)(WU_TIME_INT - 633UL) * (IXTALH / 10) / HZ_1M) - 41UL) / 16UL) << 20U))
#define CG_WUPHCR_WUEF_MASK             ((uint32_t)0x00000002)
#define CG_WUPHCR_WUON_START_SET        ((uint32_t)0x00000001)
#if (CLOCK_SETUP)
    #define CG_WUPHCR_WUCLK_SET                ((uint32_t)0x00000100)
    #define WUPHCR_INIT_PLL     ((uint32_t)(((((uint64_t)INIT_TIME_PLL * EXTALH / HZ_1M) - 16UL) /16UL) << 20U))
    #define WUPHCR_LUPT_PLL     ((uint32_t)(((((uint64_t)LOCKUP_TIME_PLL * EXTALH / HZ_1M) - 16UL) /16UL) << 20U))
    #define PLL0SEL_Ready          CG_10M_MUL_16_FPLL
#else
    #define CG_WUPHCR_WUCLK_SET                ((uint32_t)0x00000000)
    #define WUPHCR_INIT_PLL     ((uint32_t)(((((uint64_t)((INIT_TIME_PLL * 10) - 633UL) * (IXTALH / 10) / HZ_1M) - 41UL) /16UL) << 20U))
    #define WUPHCR_LUPT_PLL     ((uint32_t)(((((uint64_t)((LOCKUP_TIME_PLL * 10) - 633UL) * (IXTALH /10) / HZ_1M) - 41UL) /16UL) << 20U))
    #define PLL0SEL_Ready          CG_10M_MUL_16_FPLL
#endif

#define SIWD_SETUP              (1U)                      /* 1:Disable SIWD, 0:Enable SIWD */
#define SIWDEN_Val              (0x00000000UL)            /* SIWD Disable */
#define SIWDCR_Val              (0x000000B1UL)            /* SIWD Disable code */

#if (PLL_SETUP)
    #define PLL0SEL_Val         (PLL0SEL_Ready|0x00000003UL)
#else
    #define PLL0SEL_Val         (0x00000000UL)
#endif

#define IOSC_10M_DIV4_PLLON     (80000000UL)    /* 10.00MHz * 32.0000 / 4 */
#define IOSC_10M_DIV8_PLLON     (40000000UL)    /* 10.00MHz * 32.0000 / 8 */
#define IOSC_10M_DIV2_PLLON     (160000000UL)   /* 10.00MHz * 32.0000 / 2 */

#define EOSC_6M                 (6000000UL)
#define EOSC_8M                 (8000000UL)
#define EOSC_10M                (10000000UL)
#define EOSC_12M                (12000000UL)
#define EOSC_24M                (24000000UL)
#define EXTALH                  EOSC_10M        /* External high-speed oscillator freq */
#define EOSC_6M_DIV4_PLLON      (79970000UL)    /* 6.00MHz  * 53.3125 / 4 */
#define EOSC_8M_DIV4_PLLON      (80000000UL)    /* 8.00MHz  * 40.0000 / 4 */
#define EOSC_10M_DIV4_PLLON     (80000000UL)    /* 10.00MHz * 32.0000 / 4 */
#define EOSC_12M_DIV4_PLLON     (79880000UL)    /* 12.00MHz * 26.6250 / 4 */
#define EOSC_24M_DIV4_PLLON     (79875000UL)    /* 24.00MHz * 13.3125 / 4 */
#define EOSC_6M_DIV8_PLLON      (39980000UL)    /* 6.00MHz  * 53.3125 / 8 */
#define EOSC_8M_DIV8_PLLON      (40000000UL)    /* 8.00MHz  * 40.0000 / 8 */
#define EOSC_10M_DIV8_PLLON     (40000000UL)    /* 10.00MHz * 32.0000 / 8 */
#define EOSC_12M_DIV8_PLLON     (39940000UL)    /* 12.00MHz * 26.6250 / 8 */
#define EOSC_24M_DIV8_PLLON     (39937500UL)    /* 24.00MHz * 13.3125 / 8 */
#define EOSC_6M_DIV2_PLLON      (159900000UL)   /* 6.00MHz  * 53.3125 / 2 */
#define EOSC_8M_DIV2_PLLON      (160000000UL)   /* 8.00MHz  * 40.0000 / 2 */
#define EOSC_10M_DIV2_PLLON     (160000000UL)   /* 10.00MHz * 32.0000 / 2 */
#define EOSC_12M_DIV2_PLLON     (159800000UL)   /* 12.00MHz * 26.6250 / 2 */
#define EOSC_24M_DIV2_PLLON     (159750000UL)   /* 24.00MHz * 13.3125 / 2 */

#define FIXED_6MHz              (6000000UL)     /* 6.00MHz */
#define FIXED_8MHz              (8000000UL)     /* 8.00MHz */
#define FIXED_10MHz             (10000000UL)    /* 10.00MHz */
#define FIXED_12MHz             (12000000UL)    /* 12.00MHz */
#define FIXED_40MHz             (40000000UL)    /* 40.00MHz */
#define FIXED_80MHz             (80000000UL)    /* 80.00MHz */
#define FIXED_120MHz            (120000000UL)   /* 120.00MHz */
#define FIXED_160MHz            (160000000UL)

#define SYSCORECLOCK_ACCR_MIN       FIXED_80MHz
#define SYSCORECLOCK_ACCR_MAX       FIXED_120MHz

