iarsystems/ewarm-toshiba-example-projects/TMPM471/Libraries/system_TMPM471F10.c
static void CopyRoutine(uint32_t * dest, uint32_t * source, uint32_t size);
static void FlashReadClockSet(uint32_t sysclock);

/*--------------------------------------------------*/
/** 
  * @brief  copy 32-bit data from source to dest
  * @param  the address of source and dast, the data size
  * @retval none.
  * @note   -
  */
/*--------------------------------------------------*/
static void CopyRoutine(uint32_t * dest, uint32_t * source, uint32_t size)
{
    uint32_t *dest_addr, *source_addr, tmpsize;
    uint32_t i, tmps, tmpd, mask;

    dest_addr = dest;
    source_addr = source;

    tmpsize = size >> 2U;
    for (i = 0U; i < tmpsize; i++) {    /* 32bits copy */
        *dest_addr = *source_addr;
        dest_addr++;
        source_addr++;
    }
    if (size & 0x00000003U) {   /* if the last data size is not 0(maybe 1,2 or 3), copy the last data */
        mask = 0xFFFFFF00U;
        i = size & 0x00000003U;
        tmps = *source_addr;
        tmpd = *dest_addr;
        while (i - 1U) {
            mask = mask << 8U;
            i--;
        }
        tmps = tmps & (~mask);
        tmpd = tmpd & (mask);
        *dest_addr = tmps + tmpd;       /* 32bits copy, but only change the bytes need to be changed */
    } else {
        /* Do nothing */
    }
}

/**
 * Initialize the system
 *
 * @param  none
 * @return none
 *
 * @brief  Setup the microcontroller system.
 *         Initialize the System.
 */
void SystemInit(void)
{
#if (SIWD_SETUP)                  /* Watchdog Setup */
    /* SIWD Disable */
    TSB_SIWD0->EN = SIWDEN_Val;
    TSB_SIWD0->CR = SIWDCR_Val;
#else
    /* SIWD Enable (Setting after a Reset) */
#endif

#if (__FPU_PRESENT == 1) && (__FPU_USED == 1)   /* FPU setting */
    SCB->CPACR |= ((3UL << (10*2))|(3UL << (11*2)));  /* set CP10 and CP11 Full Access */
#endif

    CopyRoutine(FLASH_API_RAM, FLASH_API_ROM, SIZE_FLASH_API);     /* copy flash API to RAM */
    FlashReadClockSet(__CORE_SYS);

    TSB_CG->SYSCR |= SYSCR_GEAR_Val;
    TSB_CG->SYSCR |= SYSCR_PRCK_Val;

#if (CLOCK_SETUP)               /* Clock(external) Setup */
    TSB_CG->OSCCR |= CG_OSCCR_EOSCEN_SET;
    TSB_CG->WUPHCR = (WUPHCR_WUPT_EXT | CG_WUPHCR_WUCLK_SET);
    TSB_CG->WUPHCR = (WUPHCR_WUPT_EXT | CG_WUPHCR_WUCLK_SET | CG_WUPHCR_WUON_START_SET);
    while (TSB_CG->WUPHCR & CG_WUPHCR_WUEF_MASK) {
        /* no processing */
    }                           /* Warm-up */
    TSB_CG->OSCCR |= CG_OSCCR_OSCSEL_SET;
    while (!(TSB_CG->OSCCR & CG_OSCCR_OSCF_MASK)) {
        /* no processing */
    }                         /* Confirm CGOSCCR<OSCF>="1" */
#else
    /* Internal HOSC Enable (Setting after a Reset) */
#endif

    TSB_CG->SYSCR |= SYSCR_MCKSEL_Val;
    while((TSB_CG->SYSCR & CG_MCKSELGST_MASK) != (SYSCR_MCKSEL_Val & CG_MCKSEL_MASK) << 16U){
        /* no processing */
    }                         /* Confirm CGSYSCCR<MCKSELGST>="01" */
    while((TSB_CG->SYSCR & CG_MCKSELPST_MASK) != (SYSCR_MCKSEL_Val & CG_MCKSEL_MASK) << 24U){
        /* no processing */
    }                         /* Confirm CGSYSCR<MCKSELPST>="01" */
    while((TSB_CG->SYSCR & CG_GEARST_MASK) != (SYSCR_GEAR_Val & CG_GEAR_MASK) << 16U){
        /* no processing */
    }                         /* Confirm CGSYSCR<GEARST>="00" */
    while((TSB_CG->SYSCR & CG_PRCKST_MASK) != (SYSCR_PRCK_Val & CG_PRCK_MASK) << 16U){
        /* no processing */
    }                         /* Confirm CGSYSCR<PRCKST>="0000" */

#if (PLL_SETUP)
#if (CLOCK_SETUP)               /* Clock(external) Setup */
    TSB_CG->WUPHCR = (WUPHCR_INIT_PLL | CG_WUPHCR_WUCLK_SET);
#else
    TSB_CG->WUPHCR = (WUPHCR_INIT_PLL);
#endif
    TSB_CG->PLL0SEL &= CG_PLL0SEL_PLL0SEL_CLEAR;    /* PLL-->fOsc */
    TSB_CG->PLL0SEL &= CG_PLL0SEL_PLL0ON_CLEAR;
    TSB_CG->PLL0SEL = PLL0SEL_Ready;
#if (CLOCK_SETUP)               /* Clock(external) Setup */
    TSB_CG->WUPHCR = (WUPHCR_INIT_PLL | CG_WUPHCR_WUCLK_SET | CG_WUPHCR_WUON_START_SET);
#else
    TSB_CG->WUPHCR = (WUPHCR_INIT_PLL | CG_WUPHCR_WUON_START_SET);
#endif

    while (TSB_CG->WUPHCR & CG_WUPHCR_WUEF_MASK) {
        /* no processing */
    }                           /* Warm-up */

#if (CLOCK_SETUP)               /* Clock(external) Setup */
    TSB_CG->WUPHCR = (WUPHCR_LUPT_PLL | CG_WUPHCR_WUCLK_SET);
#else
    TSB_CG->WUPHCR = (WUPHCR_LUPT_PLL);
#endif
    TSB_CG->PLL0SEL |= CG_PLL0SEL_PLL0ON_SET;    /* PLL enabled */
    TSB_CG->STBYCR = STBYCR_Val;

#if (CLOCK_SETUP)               /* Clock(external) Setup */
    TSB_CG->WUPHCR = (WUPHCR_LUPT_PLL | CG_WUPHCR_WUCLK_SET | CG_WUPHCR_WUON_START_SET);
#else
    TSB_CG->WUPHCR = (WUPHCR_LUPT_PLL | CG_WUPHCR_WUON_START_SET);
#endif
    while (TSB_CG->WUPHCR & CG_WUPHCR_WUEF_MASK) {
        /* no processing */
    }                           /* Warm-up */

    TSB_CG->PLL0SEL |= CG_PLL0SEL_PLL0SEL_SET;
    while (!(TSB_CG->PLL0SEL & CG_PLL0SEL_PLL0ST_MASK)) {
        /* no processing */
    }                        /*Confirm CGPLL0SEL<PLL0ST> = "1" */
#else
    TSB_CG->STBYCR = STBYCR_Val;    /* PLL not used */
#endif/* PLL_SETUP */

#if (CLOCK_SETUP)               /* Clock(external) Setup */
    /* Internal high-speed oscillator1 is disable. */
    TSB_CG->OSCCR &= CG_OSCCR_IHOSC1EN_CLEAR;
#endif
}

#if defined ( __CC_ARM   )      /* RealView Compiler */
#pragma arm section code="FLASH_ROM"
#elif defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6100100)
__attribute__((section("FLASH_ROM")))
__attribute__((optnone))
#elif defined ( __ICCARM__ )    /* IAR Compiler */
#pragma location = "FLASH_ROM"
#elif defined ( __SES_ARM )
__attribute__ ((section("FLASH_ROM"), noinline))
#endif
static void FCRegSet(volatile uint32_t r0 __attribute__ ((unused)), volatile uint32_t r1 __attribute__ ((unused)), volatile uint32_t r2 __attribute__ ((unused)), volatile uint32_t r3 __attribute__ ((unused)))
{
    __asm("str r1, [r2]");
    __asm("str r0, [r3]");
    return;
}
#if defined ( __CC_ARM   )      /* RealView Compiler */
#pragma arm section code
#endif

/*--------------------------------------------------*/
/** 
  * @brief  Raed clock set.
  * @param  none.
  * @retval none.
  * @note   It works in the inner RAM.
  */
/*--------------------------------------------------*/
#if defined ( __CC_ARM   )      /* RealView Compiler */
#pragma arm section code="FLASH_ROM"
#elif defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6100100)
__attribute__((section("FLASH_ROM")))
#elif defined ( __ICCARM__ )    /* IAR Compiler */
#pragma location = "FLASH_ROM"
#elif defined ( __SES_ARM )
__attribute__((section("FLASH_ROM"), noinline))
#endif
static void FlashReadClockSet(uint32_t sysclock)
{
    volatile uint32_t regval       = 0;
    volatile uint32_t kcr          = FC_KCR_KEYCODE;
    volatile uint32_t kcr_address  = (uint32_t)&TSB_FC->KCR;
    volatile uint32_t accr_address = (uint32_t)&TSB_FC->FCACCR;
    uint32_t kcr_tmp               = kcr;
    uint32_t kcr_addr_tmp          = kcr_address;
    uint32_t accr_addr_tmp         = accr_address;

    if(sysclock > SYSCORECLOCK_ACCR_MAX)
    {
        regval = (uint32_t)(FC_ACCR_FCLC_6);
        FCRegSet(regval, kcr_tmp, kcr_addr_tmp, accr_addr_tmp);
        while(TSB_FC->FCACCR != (uint32_t)(FC_ACCR_FCLC_6))
        {
            /* no processing */
        }
    }
    else if((SYSCORECLOCK_ACCR_MAX >= sysclock) && (sysclock > SYSCORECLOCK_ACCR_MIN))
    {
        regval = (uint32_t)(FC_ACCR_FCLC_5);
        FCRegSet(regval, kcr_tmp, kcr_addr_tmp, accr_addr_tmp);
        while(TSB_FC->FCACCR != (uint32_t)(FC_ACCR_FCLC_5))
        {
            /* no processing */
        }
    } else {
        regval = (uint32_t)(FC_ACCR_FCLC_4);
        FCRegSet(regval, kcr_tmp, kcr_addr_tmp, accr_addr_tmp);
        while(TSB_FC->FCACCR != (uint32_t)(FC_ACCR_FCLC_4))
        {
            /* no processing */
        }
    }
}
#if defined ( __CC_ARM   )      /* RealView Compiler */
#pragma arm section code
#endif

